In [1]:
# 예제 : emp 사원 중 최대 월급, 최소 월급 출력하기
"""
SQL > select max(sal), min(sal)
        from emp;
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp['sal'].max(),emp['sal'].min())

5000 800

In [2]:
# 예제 : 부서 번호가 20인 사원들 중 최대 월급을 출력하기
"""
SQL > select max(sal)
        from emp
        where deptno=20;
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp['sal'][emp['deptno']==20].max())

# .집계함수()를 주기 전에 선택 조건을 모두 주고, 최종적으로 집계 함수로 출력하면 된다.

3000

In [3]:
# 예제 : 직업이 SALESMAN인 사원들 중 최소 월급을 출력하기
"""
SQL > select min(sal)
        from emp
        where job='SALESMAN';
"""
import pandas as pd
emp = pd.read_csv("c:\\data\\emp3.csv")
print(emp['sal'][emp['job']=='SALESMAN'].min())

1250

In [7]:
#예제 : 직업별 최고 월급을 출력하기
"""
SQL > select job, max(sal)
        from emp
        group by job;
"""
import pandas as pd
emp=pd.read_csv("c:\\data\\emp3.csv")
result=emp.groupby('job')['sal'].max()
print(result)
print('--------------------------------')
# 그룹별로 출력하고 싶을때는 SQL가 유사하게 groupby를 사용하면 된다.

"""
성공적으로 출력되었는데, 마지막 줄을 보면 데이터 타입이 시리즈인 것을 확인할 수 있다.

이러면 나중에 데이터를 만질 때 고생한다.

이것을 시리즈에서 데이터 타입으로 변환하려면

또 다시 뒤에 추가로

.reset_index() 를 작성해주면 된다.

"""

result=emp.groupby('job')['sal'].max().reset_index()
print(result)
print()
print(type(result))

# 그럼 sal 컬럼명도 출력되고, 데이터 타입도 데이터 프레임으로 바뀐 것을 확인할 수 있다.

job
ANALYST      3000
CLERK        1300
MANAGER      2975
PRESIDENT    5000
SALESMAN     1600
Name: sal, dtype: int64
--------------------------------
         job   sal
0    ANALYST  3000
1      CLERK  1300
2    MANAGER  2975
3  PRESIDENT  5000
4   SALESMAN  1600

<class 'pandas.core.frame.DataFrame'>

In [10]:
# 예제 : 부서번호별 월급의 합을 출력하기
"""
SQL > select deptno, sum(sal)
        from emp
        group by deptno;
"""
import pandas as pd
emp=pd.read_csv("c:\\data\\emp3.csv")
result=emp.groupby('deptno')['sal'].sum().reset_index()
print(result)

print('--------------------')
# 예제 : 20번을 제외한 부서번호별 월급의 합을 출력하기
"""
SQL > select deptno, sum(sal)
        from emp
        where deptno!=20
        group by deptno;
"""

print(result[['deptno','sal']][result['deptno']!=20])

   deptno    sal
0      10   8750
1      20  10875
2      30   9400
--------------------
   deptno   sal
0      10  8750
2      30  9400